In [1]:
import pandas as pd

In [7]:
dados = {'Setor':['Frutas','Frutas', 'Bebidas','Bebidas','Carnes','Carnes'],
        'Vendedores': ['Aline','Carlos','Aline','Joao','Flavia','Joao'],
        'Venda':[100,200,300,400,500,600]}

In [8]:
df = pd.DataFrame(dados)

In [9]:
df

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [11]:
df.groupby('Setor')

In [12]:
setor = df.groupby('Setor')

In [13]:
setor.min()

        Vendedores  Venda
Setor
Bebidas      Aline    300
Carnes      Flavia    500
Frutas       Aline    100

In [14]:
df.groupby('Setor').min()

        Vendedores  Venda
Setor
Bebidas      Aline    300
Carnes      Flavia    500
Frutas       Aline    100

In [15]:
setor.mean()

         Venda
Setor
Bebidas    350
Carnes     550
Frutas     150

In [16]:
setor.std()

             Venda
Setor
Bebidas  70.710678
Carnes   70.710678
Frutas   70.710678

In [17]:
setor.max()

        Vendedores  Venda
Setor
Bebidas       Joao    400
Carnes        Joao    600
Frutas      Carlos    200

In [18]:
setor.count()

         Vendedores  Venda
Setor
Bebidas           2      2
Carnes            2      2
Frutas            2      2

In [19]:
sum(df['Venda'])

2100

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Setor       6 non-null      object
 1   Vendedores  6 non-null      object
 2   Venda       6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [21]:
df

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [22]:
df.head()

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500

In [23]:
df.tail()

     Setor Vendedores  Venda
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [24]:
df.describe()

            Venda
count    6.000000
mean   350.000000
std    187.082869
min    100.000000
25%    225.000000
50%    350.000000
75%    475.000000
max    600.000000